In [1]:
import pyspark
import pandas as pd

In [2]:
churn = pd.read_csv("./data/Churn.csv", sep=";")
churn.head(2)

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,Female,42,2,0,1,1,1,10134888,1
1,608,Spain,Female,41,1,8380786,1,0,1,11254258,0

In [3]:
type(churn)

pandas.core.frame.DataFrame

In [4]:
from pyspark.sql import SparkSession

In [5]:
spark = SparkSession.builder.appName("Pandas").getOrCreate()

22/12/13 12:40:10 WARN SparkSession: Using an existing Spark session; only runtime SQL configurations will take effect.

In [6]:
churn_df = spark.createDataFrame(churn)
churn_df.show(2)

+-----------+---------+------+---+------+-------+-------------+---------+--------------+---------------+------+
|CreditScore|Geography|Gender|Age|Tenure|Balance|NumOfProducts|HasCrCard|IsActiveMember|EstimatedSalary|Exited|
+-----------+---------+------+---+------+-------+-------------+---------+--------------+---------------+------+
|        619|   France|Female| 42|     2|      0|            1|        1|             1|       10134888|     1|
|        608|    Spain|Female| 41|     1|8380786|            1|        0|             1|       11254258|     0|
+-----------+---------+------+---+------+-------+-------------+---------+--------------+---------------+------+
only showing top 2 rows

In [7]:
type(churn_df)

pyspark.sql.dataframe.DataFrame

In [8]:
pandas = churn_df.toPandas()

In [9]:
type(pandas)

pandas.core.frame.DataFrame

In [10]:
pandas.head(2)

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,Female,42,2,0,1,1,1,10134888,1
1,608,Spain,Female,41,1,8380786,1,0,1,11254258,0